---
kind: type
id: T:Autodesk.Revit.DB.FamilySizeTableManager
source: html/dc4bfffa-e529-49d5-6077-c1e03370cc6c.htm
---
# Autodesk.Revit.DB.FamilySizeTableManager

Manages importing, exporting, and querying size data through the FamilySizeTable class.

## Syntax (C#)
```csharp
public class FamilySizeTableManager : IDisposable
```